# 5. Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.
# in
# - 3    - 6
# - 2    - 1
# ->  5.099
ax = float(input('Введите координаты точки А A(x) = '))
ay = float(input('A(y) = '))
bx = float(input('Введите координаты точки B B(x) = '))
by = float(input('B(y) = '))
rezult = ((bx - ax)**2 + (by - ay)**2)**0.5
print (f'A(x)={ax}; A(y)={ay}; B(x)={bx}; B(y)={by} -> {round(rezult,3)}')